Revit 2027 API
EnergyDataSettings.CheckConstructionSetElement Method
 Checks that the construction set ElementId is acceptable.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CheckConstructionSetElement(
	ElementId constructionSetElementId
)
Public Function CheckConstructionSetElement (
	constructionSetElementId As ElementId
) As Boolean
public:
bool CheckConstructionSetElement(
	ElementId^ constructionSetElementId
)
member CheckConstructionSetElement :
        constructionSetElementId : ElementId -> bool
Parameters
constructionSetElementId ElementId
 The construction set ElementId to be checked.
Return Value
Boolean
 True if the construction set ElementId is a valid construction set element, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace